In [1]:
%reload_ext sql
%sql postgresql+psycopg2://postgres:postgres@localhost/demo

In [2]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

### UNIOIN and Union all

In [9]:
%%sql

DROP TABLE IF EXISTS employees;
DROP TABLE IF EXISTS contractors;

CREATE TABLE employees (
    employee_id SERIAL PRIMARY KEY,
    first_name  VARCHAR(50),
    last_name   VARCHAR(50),
    position    VARCHAR(50),
    salary      DECIMAL(10,2)
);

CREATE TABLE contractors (
    contractor_id SERIAL PRIMARY KEY,
    first_name    VARCHAR(50),
    last_name     VARCHAR(50),
    position      VARCHAR(50),
    hourly_rate   DECIMAL(10,2)
);

 * postgresql+psycopg2://postgres:***@localhost/demo
Done.
Done.
Done.
Done.

[]

In [10]:
%%sql
INSERT INTO employees (first_name, last_name, position, salary)
VALUES
('Alice', 'Smith', 'Developer', 70000.00),
('Bob', 'Johnson', 'Developer', 75000.00),
('Charlie', 'Lee', 'Manager', 90000.00);

INSERT INTO contractors (first_name, last_name, position, hourly_rate)
VALUES
('Dave', 'Williams', 'Developer', 40.00),
('Eve', 'Brown', 'Tester', 35.00),
('Bob', 'Johnson', 'Developer', 45.00);

 * postgresql+psycopg2://postgres:***@localhost/demo
3 rows affected.
3 rows affected.

[]

In [12]:
%%sql
select * from employees

 * postgresql+psycopg2://postgres:***@localhost/demo
3 rows affected.

[(1, 'Alice', 'Smith', 'Developer', Decimal('70000.00')),
 (2, 'Bob', 'Johnson', 'Developer', Decimal('75000.00')),
 (3, 'Charlie', 'Lee', 'Manager', Decimal('90000.00'))]

In [13]:
%%sql
select * from contractors

 * postgresql+psycopg2://postgres:***@localhost/demo
3 rows affected.

[(1, 'Dave', 'Williams', 'Developer', Decimal('40.00')),
 (2, 'Eve', 'Brown', 'Tester', Decimal('35.00')),
 (3, 'Bob', 'Johnson', 'Developer', Decimal('45.00'))]

#### Union Vs Union all

* The key difference is that UNION removes duplicate records, whereas UNION ALL includes all duplicates. 
* This distinction not only changes the number of rows in the query result, but it also impacts performance.
* For union and union all both table structure should be same.

* * Union doing deduplication, so it will take more time and slow performance.
* * Union all just doing union so it's fast.

#### Union

In [ ]:
%%sql

select first_name, last_name, position from employees

union

select first_name, last_name, position from employees

 * postgresql+psycopg2://postgres:***@localhost/demo
5 rows affected.

[('Eve', 'Brown', 'Tester'),
 ('Bob', 'Johnson', 'Developer'),
 ('Dave', 'Williams', 'Developer'),
 ('Alice', 'Smith', 'Developer'),
 ('Charlie', 'Lee', 'Manager')]

#### Union all

In [17]:
%%sql

select first_name, last_name, position from employees

union all

select first_name, last_name, position from employees

 * postgresql+psycopg2://postgres:***@localhost/demo
6 rows affected.

[('Alice', 'Smith', 'Developer'),
 ('Bob', 'Johnson', 'Developer'),
 ('Charlie', 'Lee', 'Manager'),
 ('Alice', 'Smith', 'Developer'),
 ('Bob', 'Johnson', 'Developer'),
 ('Charlie', 'Lee', 'Manager')]

In [18]:
%%sql

select first_name, last_name, position from employees

union all

select * from employees

 * postgresql+psycopg2://postgres:***@localhost/demo
(psycopg2.errors.SyntaxError) each UNION query must have the same number of columns
LINE 5: select * from employees
               ^

[SQL: select first_name, last_name, position from employees

union all

select * from employees]
(Background on this error at: https://sqlalche.me/e/20/f405)